==================
Simple symbol
==================

foo

---

(source_file
  (symbol))

==================
Simple integer
==================

42

---

(source_file
  (int))

==================
Simple float
==================

3.14

---

(source_file
  (float))

==================
Simple bigint
==================

12345678901234567890N

---

(source_file
  (bigint))

==================
Simple bigdec
==================

3.14159265358979323846M

---

(source_file
  (bigdec))

==================
Simple string
==================

"hello"

---

(source_file
  (string))

==================
Simple list
==================

(foo bar)

---

(source_file
  (list
    (symbol)
    (symbol)))

==================
Simple vector
==================

[1 2 3]

---

(source_file
  (vector
    (int)
    (int)
    (int)))

==================
Simple map
==================

{a 1}

---

(source_file
  (map
    (symbol)
    (int)))

==================
Simple set
==================

#{1 2}

---

(source_file
  (set
    (int)
    (int)))

==================
Nested list
==================

(foo (bar baz))

---

(source_file
  (list
    (symbol)
    (list
      (symbol)
      (symbol))))

==================
Simple call
==================

foo(a, b)

---

(source_file
  (call
    (symbol)
    (symbol)
    (symbol)))

==================
Java class reference (parses as qualified symbol)
==================

java:time:Instant

---

(source_file
  (qualified_symbol))

==================
Java class with field access
==================

java:time:Instant.now

---

(source_file
  (field_access
    (qualified_symbol)
    (dot_symbol)))

==================
Java class with method call
==================

java:time:Instant.parse("2024-01-01")

---

(source_file
  (method_call
    (qualified_symbol)
    (dot_symbol)
    (string)))

==================
Qualified symbol (ns:member)
==================

java:time:Instant:now

---

(source_file
  (qualified_symbol))

==================
Qualified symbol call
==================

java:time:Instant:now()

---

(source_file
  (call
    (qualified_symbol)))

==================
Simple qualified symbol
==================

foo:bar

---

(source_file
  (qualified_symbol))

==================
Qualified symbol with args
==================

math:add(1, 2)

---

(source_file
  (call
    (qualified_symbol)
    (int)
    (int)))

==================
Symbol with gensym suffix
==================

foo#

---

(source_file
  (symbol))

==================
Gensym in quoted list
==================

'(let [tmp# x] tmp#)

---

(source_file
  (quote
    (list
      (symbol)
      (vector
        (symbol)
        (symbol))
      (symbol))))

==================
Qualified symbol with gensym suffix
==================

ns:foo#

---

(source_file
  (qualified_symbol))

==================
Simple quote
==================

'foo

---

(source_file
  (quote
    (symbol)))

==================
Quote list
==================

'(1 2 3)

---

(source_file
  (quote
    (list
      (int)
      (int)
      (int))))

==================
Simple unquote
==================

~foo

---

(source_file
  (unquote
    (symbol)))

==================
Unquote in quote
==================

'(1 ~x 3)

---

(source_file
  (quote
    (list
      (int)
      (unquote
        (symbol))
      (int))))

