==================
Simple symbol
==================

foo

---

(source_file
  (symbol))

==================
Simple integer
==================

42

---

(source_file
  (int))

==================
Simple float
==================

3.14

---

(source_file
  (float))

==================
Simple bigint
==================

12345678901234567890N

---

(source_file
  (bigint))

==================
Simple bigdec
==================

3.14159265358979323846M

---

(source_file
  (bigdec))

==================
Simple string
==================

"hello"

---

(source_file
  (string))

==================
Simple list
==================

(foo bar)

---

(source_file
  (list
    (symbol)
    (symbol)))

==================
Simple vector
==================

[1 2 3]

---

(source_file
  (vector
    (int)
    (int)
    (int)))

==================
Simple map
==================

{a 1}

---

(source_file
  (map
    (symbol)
    (int)))

==================
Simple set
==================

#{1 2}

---

(source_file
  (set
    (int)
    (int)))

==================
Nested list
==================

(foo (bar baz))

---

(source_file
  (list
    (symbol)
    (list
      (symbol)
      (symbol))))

==================
Simple keyword
==================

:foo

---

(source_file
  (keyword))

==================
Keyword in map
==================

{:foo 1 :bar 2}

---

(source_file
  (map
    (keyword)
    (int)
    (keyword)
    (int)))

==================
Simple call
==================

foo(a, b)

---

(source_file
  (call
    (symbol)
    (symbol)
    (symbol)))

==================
Qualified symbol
==================

java:time:Instant

---

(source_file
  (symbol))

==================
Qualified symbol with field access
==================

java:time:Instant.now

---

(source_file
  (field_access
    (symbol)
    (dot_symbol)))

==================
Qualified symbol with method call
==================

java:time:Instant.parse("2024-01-01")

---

(source_file
  (method_call
    (symbol)
    (dot_symbol)
    (string)))

